{
  "1": 0,
  "2": 2,
  "3": 2,
  "4": 3,
  "5": 0,
  "6": 1,
  "7": 0,
  "8": 3,
  "9": 0,
  "10": 3,
  "11": 1,
  "12": 3,
  "13": 0,
  "14": 0,
  "15": 0,
  "16": 1,
  "17": 1,
  "18": 1,
  "19": 1,
  "20": 0,
  "21": 0,
  "22": 0,
  "23": 4,
  "24": 0,
  "25": 0,
  "26": 0,
  "27": 0,
  "28": 0,
  "29": 0,
  "30": 0,
  "31": 0,
  "32": 0,
  "33": 1,
  "34": 0,
  "35": 0,
  "36": 0,
  "37": 1,
  "38": 0,
  "39": 0,
  "40": 0,
  "41": 0,
  "42": 0,
  "43": 0,
  "44": 0,
  "45": 1,
  "46": 0,
  "47": 1,
  "48": 1,
  "49": 0,
  "50": 0,
  "51": 0,
  "52": 0,
  "53": 0,
  "54": 0,
  "55": 0,
  "56": 0,
  "57": 0,
  "58": 1,
  "59": 0,
  "60": 1,
  "61": 0,
  "62": 0,
  "63": 0,
  "64": 0,
  "65": 0,
  "66": 0,
  "67": 2,
  "68": 0,
  "69": 0,
  "70": 0,
  "71": 0,
  "72": 0,
  "73": 1,
  "74": 0,
  "75": 1,
  "76": 1,
  "77": 0,
  "78": 0,
  "79": 1,
  "80": 0,
  "81": 0,
  "82": 0,
  "83": 1,
  "84": 0,
  "85": 0,
  "86": 2,
  "87": 0,
  "88": 0,
  "89": 0,
  "90": 2,
  "91": 0,
  "92": 0,
  "93": 0,
  "94": 0,
  "95": 0,
  "96": 0,
  "97": 0,
  "98": 0,
  "99": 2,
  "100": 0,
  "101": 0,
  "102": 0,
  "103": 0,
  "104": 1,
  "105": 0,
  "106": 0,
  "107": 0,
  "108": 0,
  "109": 0,
  "110": 0,
  "111": 0,
  "112": 3,
  "113": 2,
  "114": 3,
  "115": 2,
  "116": 1,
  "117": 1,
  "118": 3,
  "119": 2,
  "120": 3,
  "121": 3,
  "122": 3,
  "123": 2,
  "124": 3,
  "125": 1,
  "126": 0,
  "127": 0,
  "128": 0,
  "129": 0,
  "130": 0,
  "131": 0,
  "132": 2,
  "133": 1,
  "134": 0,
  "135": 2,
  "136": 0,
  "137": 0,
  "138": 1,
  "139": 0,
  "140": 0,
  "141": 0,
  "142": 0,
  "143": 1,
  "144": 0,
  "145": 1,
  "146": 0,
  "147": 0,
  "148": 0,
  "149": 0,
  "150": 0,
  "151": 0,
  "152": 0,
  "153": 0,
  "154": 0,
  "155": 0,
  "156": 0,
  "157": 1,
  "158": 3,
  "159": 3,
  "160": 3,
  "161": 0,
  "162": 2,
  "163": 1,
  "164": 0,
  "165": 0,
  "166": 0,
  "167": 0,
  "168": 0,
  "169": 0,
  "170": 0,
  "171": 0,
  "172": 0,
  "173": 0,
  "174": 0,
  "175": 1,
  "176": 2,
  "177": 3,
  "178": 0,
  "179": 0,
  "180": 0,
  "181": 0,
  "182": 0,
  "183": 0,
  "184": 0,
  "185": 0,
  "186": 0,
  "187": 0,
  "188": 0,
  "189": 0,
  "190": 3,
  "191": 3,
  "192": 4,
  "193": 2,
  "194": 0,
  "195": 2,
  "196": 0,
  "197": 2,
  "198": 0,
  "199": 0,
  "200": 0,
  "201": 0,
  "202": 0,
  "203": 0,
  "204": 1,
  "205": 3,
  "206": 0,
  "207": 0,
  "208": 1,
  "209": 2,
  "210": 0,
  "211": 1,
  "212": 0,
  "213": 2,
  "214": 0,
  "215": 0,
  "216": 0,
  "217": 3,
  "218": 3,
  "219": 1,
  "220": 1,
  "221": 0,
  "222": 3,
  "223": 1,
  "224": 0,
  "225": 0,
  "226": 2,
  "227": 0,
  "228": 1,
  "229": 0,
  "230": 2,
  "231": 0,
  "232": 0,
  "233": 2,
  "234": 3,
  "235": 3,
  "236": 3,
  "237": 2,
  "238": 3,
  "239": 2,
  "240": 3,
  "241": 2,
  "242": 1,
  "243": 1,
  "244": 2,
  "245": 3,
  "246": 1,
  "247": 0,
  "248": 1,
  "249": 0,
  "250": 0,
  "251": 2,
  "252": 0,
  "253": 2,
  "254": 0,
  "255": 2,
  "256": 3,
  "257": 4,
  "258": 3,
  "259": 0,
  "260": 0,
  "261": 2,
  "262": 0,
  "263": 0,
  "264": 1,
  "265": 2,
  "266": 0,
  "267": 2,
  "268": 1,
  "269": 0,
  "270": 0,
  "271": 0,
  "272": 0,
  "273": 0,
  "274": 0,
  "275": 0,
  "276": 0,
  "277": 0,
  "278": 0,
  "279": 2,
  "280": 1,
  "281": 1,
  "282": 0,
  "283": 2,
  "284": 0,
  "285": 1,
  "286": 1,
  "287": 0,
  "288": 0,
  "289": 0,
  "290": 0,
  "291": 0,
  "292": 0,
  "293": 0,
  "294": 0,
  "295": 0,
  "296": 0,
  "297": 0,
  "298": 0,
  "299": 0,
  "300": 0,
  "301": 0,
  "302": 0,
  "303": 0,
  "304": 0,
  "305": 0,
  "306": 1,
  "307": 0,
  "308": 0,
  "309": 1,
  "310": 0,
  "311": 0,
  "312": 0,
  "313": 0,
  "314": 0,
  "315": 0,
  "316": 0,
  "317": 0,
  "318": 0,
  "319": 1,
  "320": 0,
  "321": 0,
  "322": 1,
  "323": 0,
  "324": 0,
  "325": 0,
  "326": 1,
  "327": 0,
  "328": 0,
  "329": 0,
  "330": 0,
  "331": 0,
  "332": 0,
  "333": 0,
  "334": 0,
  "335": 0,
  "336": 0,
  "337": 0,
  "338": 0,
  "339": 0,
  "340": 2,
  "341": 2,
  "342": 3,
  "343": 0,
  "344": 0,
  "345": 0,
  "346": 3,
  "347": 1,
  "348": 0,
  "349": 1,
  "350": 0,
  "351": 0,
  "352": 0,
  "353": 0,
  "354": 0,
  "355": 0,
  "356": 0,
  "357": 0,
  "358": 0,
  "359": 0,
  "360": 0,
  "361": 0,
  "362": 0,
  "363": 2,
  "364": 0,
  "365": 0,
  "366": 0,
  "367": 0,
  "368": 2,
  "369": 2,
  "370": 0,
  "371": 0,
  "372": 0,
  "373": 0,
  "374": 0,
  "375": 0,
  "376": 0,
  "377": 0,
  "378": 0,
  "379": 1,
  "380": 0,
  "381": 0,
  "382": 0,
  "383": 0,
  "384": 0,
  "385": 0,
  "386": 2,
  "387": 2,
  "388": 0,
  "389": 0,
  "390": 0,
  "391": 0,
  "392": 0,
  "393": 0,
  "394": 0,
  "395": 0,
  "396": 1,
  "397": 0,
  "398": 0,
  "399": 1,
  "400": 0,
  "401": 0,
  "402": 0,
  "403": 0,
  "404": 0,
  "405": 0,
  "406": 0,
  "407": 2,
  "408": 0,
  "409": 1,
  "410": 0,
  "411": 0,
  "412": 0,
  "413": 0,
  "414": 0,
  "415": 0,
  "416": 0,
  "417": 0,
  "418": 1,
  "419": 0,
  "420": 0,
  "421": 0,
  "422": 0,
  "423": 0,
  "424": 0,
  "425": 0,
  "426": 0,
  "427": 2,
  "428": 2,
  "429": 0,
  "430": 0,
  "431": 0,
  "432": 0,
  "433": 0,
  "434": 0,
  "435": 0,
  "436": 0,
  "437": 0,
  "438": 0,
  "439": 2,
  "440": 0,
  "441": 0,
  "442": 0,
  "443": 0,
  "444": 3,
  "445": 1,
  "446": 0,
  "447": 0,
  "448": 0,
  "449": 1,
  "450": 0,
  "451": 0,
  "452": 0,
  "453": 0,
  "454": 0,
  "455": 0,
  "456": 0,
  "457": 2,
  "458": 1,
  "459": 1,
  "460": 0,
  "461": 0,
  "462": 0,
  "463": 0,
  "464": 0,
  "465": 0,
  "466": 0,
  "467": 0,
  "468": 0,
  "469": 2,
  "470": 0,
  "471": 0,
  "472": 0,
  "473": 0,
  "474": 0,
  "475": 0,
  "476": 0,
  "477": 0,
  "478": 0,
  "479": 0,
  "480": 0,
  "481": 0,
  "482": 0,
  "483": 0,
  "484": 0,
  "485": 0,
  "486": 0,
  "487": 0,
  "488": 0,
  "489": 0,
  "490": 1,
  "491": 0,
  "492": 0,
  "493": 0,
  "494": 0,
  "495": 0,
  "496": 0,
  "497": 0,
  "498": 0,
  "499": 0,
  "500": 0,
  "501": 0,
  "502": 0,
  "503": 0,
  "504": 0,
  "505": 0,
  "506": 0,
  "507": 0,
  "508": 0,
  "509": 0,
  "510": 0,
  "511": 0,
  "512": 0,
  "513": 0,
  "514": 0,
  "515": 0,
  "516": 0,
  "517": 0,
  "518": 0,
  "519": 0,
  "520": 0,
  "521": 0,
  "522": 0,
  "523": 0,
  "524": 0,
  "525": 0,
  "526": 0,
  "527": 0,
  "528": 0,
  "529": 0,
  "530": 0,
  "531": 0,
  "532": 0,
  "533": 0,
  "534": 0,
  "535": 0,
  "536": 2,
  "537": 1,
  "538": 1,
  "539": 2,
  "540": 0,
  "541": 0,
  "542": 0,
  "543": 0,
  "544": 0,
  "545": 0,
  "546": 0,
  "547": 2,
  "548": 2,
  "549": 1,
  "550": 1,
  "551": 0,
  "552": 0,
  "553": 3,
  "554": 0,
  "555": 0,
  "556": 0,
  "557": 0,
  "558": 0,
  "559": 0,
  "560": 0,
  "561": 0,
  "562": 0,
  "563": 2,
  "564": 2,
  "565": 1,
  "566": 0,
  "567": 0,
  "568": 0,
  "569": 0,
  "570": 1,
  "571": 0,
  "572": 0,
  "573": 0,
  "574": 0,
  "575": 0,
  "576": 0,
  "577": 0,
  "578": 0,
  "579": 0,
  "580": 0,
  "581": 0,
  "582": 0,
  "583": 0,
  "584": 2,
  "585": 3,
  "586": 0,
  "587": 0,
  "588": 0,
  "589": 2,
  "590": 1,
  "591": 0,
  "592": 0,
  "593": 0,
  "594": 0,
  "595": 0,
  "596": 0,
  "597": 0,
  "598": 0,
  "599": 1,
  "600": 5,
  "601": 3,
  "602": 0,
  "603": 0,
  "604": 0,
  "605": 0,
  "606": 0,
  "607": 2,
  "608": 3,
  "609": 0,
  "610": 1,
  "611": 1,
  "612": 0,
  "613": 0,
  "614": 0,
  "615": 0,
  "616": 0,
  "617": 0,
  "618": 0,
  "619": 0,
  "620": 0,
  "621": 0,
  "622": 0,
  "623": 0,
  "624": 0,
  "625": 0,
  "626": 0,
  "627": 0,
  "628": 0,
  "629": 0,
  "630": 0,
  "631": 0,
  "632": 0,
  "633": 0,
  "634": 0,
  "635": 0,
  "636": 0,
  "637": 0,
  "638": 0,
  "639": 0,
  "640": 0,
  "641": 0,
  "642": 0,
  "643": 0,
  "644": 0,
  "645": 3,
  "646": 0,
  "647": 1,
  "648": 0,
  "649": 3,
  "650": 2,
  "651": 1,
  "652": 1,
  "653": 1,
  "654": 0,
  "655": 0,
  "656": 1,
  "657": 0,
  "658": 0,
  "659": 0,
  "660": 0,
  "661": 3,
  "662": 3,
  "663": 3,
  "664": 3,
  "665": 0,
  "666": 0,
  "667": 0,
  "668": 1,
  "669": 0,
  "670": 3,
  "671": 0,
  "672": 0,
  "673": 3,
  "674": 1,
  "675": 3,
  "676": 0,
  "677": 1,
  "678": 0,
  "679": 0,
  "680": 0,
  "681": 0,
  "682": 0,
  "683": 0,
  "684": 0,
  "685": 1,
  "686": 1,
  "687": 0,
  "688": 0,
  "689": 1,
  "690": 2,
  "691": 1,
  "692": 2,
  "693": 0,
  "694": 2,
  "695": 1,
  "696": 2,
  "697": 4,
  "698": 0,
  "699": 4,
  "700": 0,
  "701": 0,
  "702": 1,
  "703": 1,
  "704": 0,
  "705": 0,
  "706": 1,
  "707": 0,
  "708": 3,
  "709": 0,
  "710": 0,
  "711": 1,
  "712": 1,
  "713": 0,
  "714": 0,
  "715": 2,
  "716": 1,
  "717": 2,
  "718": 1,
  "719": 0,
  "720": 0,
  "721": 0,
  "722": 0,
  "723": 0,
  "724": 0,
  "725": 0,
  "726": 0,
  "727": 0,
  "728": 0,
  "729": 0,
  "730": 0,
  "731": 1,
  "732": 0,
  "733": 0,
  "734": 0,
  "735": 0,
  "736": 0,
  "737": 1,
  "738": 0,
  "739": 0,
  "740": 0,
  "741": 0,
  "742": 0,
  "743": 0,
  "744": 0,
  "745": 0,
  "746": 0,
  "747": 0,
  "748": 4,
  "749": 4,
  "750": 1,
  "751": 3,
  "752": 3,
  "753": 0,
  "754": 1,
  "755": 0,
  "756": 0,
  "757": 0,
  "758": 0,
  "759": 0,
  "760": 0,
  "761": 1,
  "762": 0,
  "763": 0,
  "764": 3,
  "765": 0,
  "766": 1,
  "767": 0,
  "768": 0,
  "769": 0,
  "770": 0,
  "771": 0,
  "772": 0,
  "773": 0,
  "774": 1,
  "775": 0,
  "776": 0,
  "777": 0,
  "778": 2,
  "779": 0,
  "780": 0,
  "781": 0,
  "782": 0,
  "783": 1,
  "784": 0,
  "785": 3,
  "786": 0,
  "787": 0,
  "788": 0,
  "789": 2,
  "790": 2,
  "791": 1,
  "792": 0,
  "793": 1,
  "794": 0,
  "795": 0,
  "796": 0,
  "797": 2,
  "798": 0,
  "799": 0,
  "800": 0,
  "801": 0,
  "802": 0,
  "803": 0,
  "804": 2,
  "805": 0,
  "806": 2,
  "807": 1,
  "808": 3,
  "809": 2,
  "810": 1,
  "811": 3,
  "812": 0,
  "813": 0,
  "814": 0,
  "815": 0,
  "816": 0,
  "817": 0,
  "818": 0,
  "819": 0,
  "820": 0,
  "821": 0,
  "822": 0,
  "823": 0,
  "824": 0,
  "825": 0,
  "826": 0,
  "827": 0,
  "828": 0,
  "829": 0,
  "830": 0,
  "831": 0,
  "832": 0,
  "833": 0,
  "834": 2,
  "835": 1,
  "836": 0,
  "837": 1,
  "838": 0,
  "839": 0,
  "840": 0,
  "841": 0,
  "842": 0,
  "843": 0,
  "844": 0,
  "845": 0,
  "846": 0,
  "847": 0,
  "848": 0,
  "849": 4,
  "850": 2,
  "851": 0,
  "852": 3,
  "853": 2,
  "854": 1,
  "855": 0,
  "856": 3,
  "857": 3,
  "858": 0,
  "859": 0,
  "860": 2,
  "861": 3,
  "862": 0,
  "863": 0,
  "864": 1,
  "865": 0,
  "866": 0,
  "867": 3,
  "868": 3,
  "869": 3,
  "870": 0,
  "871": 0,
  "872": 0,
  "873": 0,
  "874": 0,
  "875": 0,
  "876": 2,
  "877": 2,
  "878": 2,
  "879": 2,
  "880": 0,
  "881": 0,
  "882": 0,
  "883": 3,
  "884": 3,
  "885": 4,
  "886": 0,
  "887": 0,
  "888": 2,
  "889": 0,
  "890": 0,
  "891": 0,
  "892": 2,
  "893": 0,
  "894": 0,
  "895": 2,
  "896": 0,
  "897": 2,
  "898": 0,
  "899": 0,
  "900": 0,
  "901": 1,
  "902": 0,
  "903": 0,
  "904": 0,
  "905": 0,
  "906": 0,
  "907": 1,
  "908": 0,
  "909": 0,
  "910": 0,
  "911": 0,
  "912": 0,
  "913": 1,
  "914": 0,
  "915": 0,
  "916": 0,
  "917": 0,
  "918": 4,
  "919": 3,
  "920": 4,
  "921": 3,
  "922": 0,
  "923": 3,
  "924": 0,
  "925": 1,
  "926": 0,
  "927": 0,
  "928": 0,
  "929": 2,
  "930": 0,
  "931": 0,
  "932": 0,
  "933": 0,
  "934": 0,
  "935": 1,
  "936": 0,
  "937": 2,
  "938": 0,
  "939": 0,
  "940": 0,
  "941": 0,
  "942": 0,
  "943": 0,
  "944": 1,
  "945": 0,
  "946": 0,
  "947": 0,
  "948": 0,
  "949": 0,
  "950": 2,
  "951": 0,
  "952": 4,
  "953": 3,
  "954": 0,
  "955": 2,
  "956": 3,
  "957": 1,
  "958": 2,
  "959": 1,
  "960": 3,
  "961": 2,
  "962": 0,
  "963": 0,
  "964": 0,
  "965": 0,
  "966": 0,
  "967": 0,
  "968": 0,
  "969": 0,
  "970": 0,
  "971": 0,
  "972": 0,
  "973": 0,
  "974": 0,
  "975": 0,
  "976": 0,
  "977": 0,
  "978": 0,
  "979": 0,
  "980": 0,
  "981": 0,
  "982": 0,
  "983": 0,
  "984": 0,
  "985": 0,
  "986": 0,
  "987": 0,
  "988": 0,
  "989": 0,
  "990": 0,
  "991": 0,
  "992": 0,
  "993": 0,
  "994": 0,
  "995": 0,
  "996": 0,
  "997": 0,
  "998": 0,
  "999": 0,
  "1000": 0,
  "1001": 0,
  "1002": 0,
  "1003": 0,
  "1004": 0,
  "1005": 0,
  "1006": 0,
  "1007": 0,
  "1008": 1,
  "1009": 0,
  "1010": 0,
  "1011": 0,
  "1012": 0,
  "1013": 4,
  "1014": 0,
  "1015": 0,
  "1016": 0,
  "1017": 0,
  "1018": 0,
  "1019": 0,
  "1020": 4,
  "1021": 3,
  "1022": 0,
  "1023": 3,
  "1024": 0,
  "1025": 0,
  "1026": 0,
  "1027": 0,
  "1028": 0,
  "1029": 0,
  "1030": 0,
  "1031": 0,
  "1032": 1,
  "1033": 1,
  "1034": 0,
  "1035": 0,
  "1036": 0,
  "1037": 0,
  "1038": 0,
  "1039": 1,
  "1040": 0,
  "1041": 1,
  "1042": 0,
  "1043": 0,
  "1044": 0,
  "1045": 0,
  "1046": 0,
  "1047": 0,
  "1048": 0,
  "1049": 1,
  "1050": 0,
  "1051": 0,
  "1052": 0,
  "1053": 0,
  "1054": 0,
  "1055": 0,
  "1056": 0,
  "1057": 1,
  "1058": 0,
  "1059": 0,
  "1060": 0,
  "1061": 0,
  "1062": 0,
  "1063": 2,
  "1064": 0,
  "1065": 0,
  "1066": 0,
  "1067": 0,
  "1068": 0,
  "1069": 0,
  "1070": 0,
  "1071": 0,
  "1072": 2,
  "1073": 0,
  "1074": 0,
  "1075": 0,
  "1076": 0,
  "1077": 0,
  "1078": 0,
  "1079": 0,
  "1080": 0,
  "1081": 0,
  "1082": 2,
  "1083": 0,
  "1084": 0,
  "1085": 0,
  "1086": 0,
  "1087": 4,
  "1088": 3,
  "1089": 0,
  "1090": 0,
  "1091": 4,
  "1092": 0,
  "1093": 2,
  "1094": 4,
  "1095": 3,
  "1096": 3,
  "1097": 2,
  "1098": 4,
  "1099": 0,
  "1100": 4,
  "1101": 0,
  "1102": 2,
  "1103": 3,
  "1104": 1,
  "1105": 0,
  "1106": 1,
  "1107": 0,
  "1108": 0,
  "1109": 0,
  "1110": 0,
  "1111": 0,
  "1112": 1,
  "1113": 1,
  "1114": 0,
  "1115": 0,
  "1116": 0,
  "1117": 0,
  "1118": 0,
  "1119": 0,
  "1120": 0,
  "1121": 0,
  "1122": 0,
  "1123": 0,
  "1124": 0,
  "1125": 0,
  "1126": 0,
  "1127": 0,
  "1128": 0,
  "1129": 3,
  "1130": 3,
  "1131": 0,
  "1132": 3,
  "1133": 3,
  "1134": 3,
  "1135": 3,
  "1136": 3,
  "1137": 3,
  "1138": 3,
  "1139": 0,
  "1140": 0,
  "1141": 0,
  "1142": 0,
  "1143": 3,
  "1144": 1,
  "1145": 0,
  "1146": 0,
  "1147": 0,
  "1148": 1,
  "1149": 0,
  "1150": 2,
  "1151": 0,
  "1152": 0,
  "1153": 0,
  "1154": 0,
  "1155": 0,
  "1156": 0,
  "1157": 0,
  "1158": 0,
  "1159": 1,
  "1160": 1,
  "1161": 0,
  "1162": 0,
  "1163": 2,
  "1164": 0,
  "1165": 2,
  "1166": 0,
  "1167": 0,
  "1168": 0,
  "1169": 0,
  "1170": 0,
  "1171": 0,
  "1172": 0,
  "1173": 3,
  "1174": 2,
  "1175": 1,
  "1176": 0,
  "1177": 3,
  "1178": 0,
  "1179": 0,
  "1180": 0,
  "1181": 0,
  "1182": 0,
  "1183": 0,
  "1184": 0,
  "1185": 0,
  "1186": 0,
  "1187": 0,
  "1188": 0,
  "1189": 0,
  "1190": 0,
  "1191": 1,
  "1192": 0,
  "1193": 0,
  "1194": 3,
  "1195": 0,
  "1196": 0,
  "1197": 0,
  "1198": 0,
  "1199": 0,
  "1200": 0,
  "1201": 3,
  "1202": 0,
  "1203": 0,
  "1204": 0,
  "1205": 1,
  "1206": 1,
  "1207": 3,
  "1208": 2,
  "1209": 4,
  "1210": 3,
  "1211": 2,
  "1212": 0,
  "1213": 2,
  "1214": 0,
  "1215": 1,
  "1216": 1,
  "1217": 2,
  "1218": 2,
  "1219": 0,
  "1220": 0,
  "1221": 0,
  "1222": 1,
  "1223": 0,
  "1224": 0,
  "1225": 0,
  "1226": 0,
  "1227": 0,
  "1228": 3,
  "1229": 0,
  "1230": 0,
  "1231": 0,
  "1232": 0,
  "1233": 3,
  "1234": 0,
  "1235": 0,
  "1236": 4,
  "1237": 3,
  "1238": 2,
  "1239": 4,
  "1240": 3,
  "1241": 3,
  "1242": 2,
  "1243": 3,
  "1244": 0,
  "1245": 0,
  "1246": 0,
  "1247": 0,
  "1248": 4,
  "1249": 2,
  "1250": 3,
  "1251": 3,
  "1252": 0,
  "1253": 0,
  "1254": 3,
  "1255": 0,
  "1256": 2,
  "1257": 2,
  "1258": 0,
  "1259": 0,
  "1260": 0,
  "1261": 1,
  "1262": 2,
  "1263": 0,
  "1264": 0,
  "1265": 3,
  "1266": 3,
  "1267": 0,
  "1268": 0,
  "1269": 0,
  "1270": 2,
  "1271": 0,
  "1272": 1,
  "1273": 0,
  "1274": 0,
  "1275": 0,
  "1276": 0,
  "1277": 0,
  "1278": 2,
  "1279": 3,
  "1280": 2,
  "1281": 0,
  "1282": 0,
  "1283": 0,
  "1284": 3,
  "1285": 2,
  "1286": 0,
  "1287": 0,
  "1288": 0,
  "1289": 3,
  "1290": 5,
  "1291": 0,
  "1292": 0,
  "1293": 2,
  "1294": 0,
  "1295": 3,
  "1296": 2,
  "1297": 0,
  "1298": 0,
  "1299": 4,
  "1300": 0,
  "1301": 4,
  "1302": 3,
  "1303": 3,
  "1304": 2,
  "1305": 0,
  "1306": 2,
  "1307": 3,
  "1308": 2,
  "1309": 2,
  "1310": 2,
  "1311": 0,
  "1312": 0,
  "1313": 1,
  "1314": 0,
  "1315": 0,
  "1316": 0,
  "1317": 0,
  "1318": 0,
  "1319": 0,
  "1320": 0,
  "1321": 0,
  "1322": 0,
  "1323": 0,
  "1324": 0,
  "1325": 0,
  "1326": 0,
  "1327": 0,
  "1328": 0,
  "1329": 2,
  "1330": 2,
  "1331": 0,
  "1332": 3,
  "1333": 0,
  "1334": 0,
  "1335": 0,
  "1336": 0,
  "1337": 0,
  "1338": 2,
  "1339": 0,
  "1340": 0,
  "1341": 0,
  "1342": 1,
  "1343": 1,
  "1344": 0,
  "1345": 0,
  "1346": 0,
  "1347": 0,
  "1348": 0,
  "1349": 0,
  "1350": 0,
  "1351": 2,
  "1352": 0,
  "1353": 0,
  "1354": 0,
  "1355": 0,
  "1356": 0,
  "1357": 2,
  "1358": 0,
  "1359": 0,
  "1360": 0,
  "1361": 1,
  "1362": 0,
  "1363": 0,
  "1364": 0,
  "1365": 0,
  "1366": 1,
  "1367": 1,
  "1368": 1,
  "1369": 0,
  "1370": 0,
  "1371": 0,
  "1372": 0,
  "1373": 0,
  "1374": 1,
  "1375": 0,
  "1376": 0,
  "1377": 0,
  "1378": 0,
  "1379": 0,
  "1380": 0,
  "1381": 0,
  "1382": 0,
  "1383": 0,
  "1384": 0,
  "1385": 0,
  "1386": 3,
  "1387": 3,
  "1388": 0,
  "1389": 1,
  "1390": 0,
  "1391": 1,
  "1392": 3,
  "1393": 3,
  "1394": 2,
  "1395": 3,
  "1396": 3,
  "1397": 3,
  "1398": 2,
  "1399": 4,
  "1400": 0,
  "1401": 0,
  "1402": 0,
  "1403": 0,
  "1404": 0,
  "1405": 1,
  "1406": 1,
  "1407": 3,
  "1408": 2,
  "1409": 1,
  "1410": 4,
  "1411": 3,
  "1412": 1,
  "1413": 3,
  "1414": 1,
  "1415": 4,
  "1416": 4,
  "1417": 4,
  "1418": 1,
  "1419": 4,
  "1420": 6,
  "1421": 5,
  "1422": 1,
  "1423": 0,
  "1424": 0,
  "1425": 0,
  "1426": 0,
  "1427": 2,
  "1428": 1,
  "1429": 0,
  "1430": 1,
  "1431": 0,
  "1432": 2,
  "1433": 1,
  "1434": 0,
  "1435": 0,
  "1436": 0,
  "1437": 0,
  "1438": 1,
  "1439": 2,
  "1440": 0,
  "1441": 2,
  "1442": 0,
  "1443": 1,
  "1444": 1,
  "1445": 0,
  "1446": 1,
  "1447": 1,
  "1448": 1,
  "1449": 1,
  "1450": 1,
  "1451": 1,
  "1452": 1,
  "1453": 0,
  "1454": 0,
  "1455": 3,
  "1456": 3,
  "1457": 1,
  "1458": 4,
  "1459": 1,
  "1460": 1,
  "1461": 3,
  "1462": 0,
  "1463": 2,
  "1464": 0,
  "1465": 3,
  "1466": 2,
  "1467": 2,
  "1468": 1,
  "1469": 2,
  "1470": 1,
  "1471": 1,
  "1472": 0,
  "1473": 0,
  "1474": 1,
  "1475": 2,
  "1476": 0,
  "1477": 0,
  "1478": 1,
  "1479": 3,
  "1480": 2,
  "1481": 1,
  "1482": 0,
  "1483": 0,
  "1484": 1,
  "1485": 1,
  "1486": 1,
  "1487": 0,
  "1488": 2,
  "1489": 1,
  "1490": 2,
  "1491": 1,
  "1492": 1,
  "1493": 1,
  "1494": 0,
  "1495": 3,
  "1496": 0,
  "1497": 1,
  "1498": 1,
  "1499": 0,
  "1500": 1,
  "1501": 1,
  "1502": 0,
  "1503": 1,
  "1504": 1,
  "1505": 2,
  "1506": 3,
  "1507": 0,
  "1508": 2,
  "1509": 3,
  "1510": 0,
  "1511": 0,
  "1512": 1,
  "1513": 0,
  "1514": 0,
  "1515": 0,
  "1516": 2,
  "1517": 3,
  "1518": 4,
  "1519": 3,
  "1520": 1,
  "1521": 0,
  "1522": 0
}